2024/01/22/locally-overriding-a-function-throughout-a-dynamic-extent/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Locally overriding a function throughout a dynamic extent | Simon Dobson</title>
<link rel="icon" href="../../../../images/favicon.png" sizes="16x16">
<link rel="alternate" type="application/rss+xml" href="../../../../rss.xml">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono%7CLibre+Baskerville%7CMontserrat%7CPlayfair+Display%7CTangerine">
<link rel="stylesheet" href="../../../../assets/css/libretto_styles.css">
<link rel="stylesheet" href="../../../../assets/css/baguetteBox.min.css">
<link rel="stylesheet" href="../../../../assets/css/code.css">
<link rel="stylesheet" href="../../../../assets/css/nikola_rst.css">
<link rel="stylesheet" href="../../../../assets/css/nikola_ipython.css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
	    <h1 class="site-title">
		<a href="https://simondobson.org/" title="Simon Dobson" rel="home">Simon&nbsp;Dobson</a>
	    </h1>
	</div>
	<nav class="site-navigation" role="navigation"><div class="menu-toggle">
		<span class="mobile-site-title">Simon Dobson</span>
	    </div>
	    <ul class="menu">
<li><a href="../../../../index.html">Home</a></li>
		    <li><a href="../../../../personal/">About&nbsp;me</a></li>
		    <li><a href="../../../../research/">Research</a></li>
		    <li><a href="../../../../development/projects/">Software</a></li>
		    <li><a href="../../../../writing/">Writing</a></li>
		    <li><a href="../../../../personal/contact/">Contact</a></li>
		<li>
<a href="../../../../rss.xml"><i class="fa fa-rss"></i></a>
	    </li>
</ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
	<div class="entry-meta">
	    <span class="posted-on">
		Posted on <a href="." rel="bookmark">Monday 22 January, 2024</a>
	    </span>
	</div>
	<h1>Locally overriding a function throughout a dynamic&nbsp;extent</h1>
    </div>

	<!-- Page Content -->
    <div class="site-content" role="main">
	<article class="format-standard libretto-long-form"><div class="entry-content">
		<div id="outline-container-org5abe933" class="outline-2">
<h2 id="org5abe933">Locally overriding a function throughout a dynamic&nbsp;extent</h2>
<div class="outline-text-2" id="text-org5abe933">
<p>
A horribly dangerous but occasionally useful Lisp&nbsp;technique.
</p>

<p>
My use case is as&nbsp;follows. <code>ebib</code> has a command to copy a
formatted reference to the kill ring,&nbsp;using
<code>citar-citeproc-format-reference</code> to actually do the formatting.
This means it&#8217;s easy to change the style of the formatted
reference.&nbsp;However, <code>citar-citeproc-format-reference</code>  itself&nbsp;uses
<code>citar-render-bib</code> with a plain-text formatter. This is a sensible
default, but since I&#8217;m almost always copying references into
org-more documents, it loses a lot of information: it&#8217;d be better
to use the org formatter, but there&#8217;s no argument to specify&nbsp;it.
</p>

<p>
Clearly the correct solution is to&nbsp;change
<code>citar-citeproc-format-reference</code> to take a key or optional
argument to specify the formatter, but that involves changing
someone else&#8217;s code. The hacker solution is to change the&nbsp;call
<code>(citeproc-render-bib proc 'plain)</code> to <code>(citeproc-render-bib proc
  'org)</code>, but without re-writing the entire surrounding function to
keep the change just to the case where I need&nbsp;it.
</p>

<p>
One way to do this would be to define a&nbsp;variant
<code>citeproc-render-bib</code> that ignores its second argument (the
formatter) and always&nbsp;uses <code>'org</code> instead, and then substitute
this variant for the original – but <i>only</i> in the dynamic extent
of a <i>particular</i> call&nbsp;to <code>citar-citeproc-format-reference</code>. In
most languages this would be impossible – but not in Emacs&nbsp;Lisp.
</p>

<p>
The solution is to&nbsp;use <code>cl-letf</code>, which overrides the values of
general places for the duration of its body forms and restores the
original value on exit (normal or otherwise). The important point
is that the change occurs across the <i>extent</i> of the body – the
body and all the code called from the body – and not merely in
the <i>scope</i> of the body, which would only affect calls made there&nbsp;directly.
</p>

<p>
For example, consider in the&nbsp;following:
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="nf">defun</span><span class="w"> </span><span class="nv">f</span><span class="p">(</span><span class="nf">a</span><span class="w"> </span><span class="nv">b</span><span class="p">)</span>
<span class="w">  </span><span class="p">(</span><span class="nb">+</span><span class="w"> </span><span class="nv">a</span><span class="w"> </span><span class="nv">b</span><span class="p">))</span>

<span class="p">(</span><span class="nf">defun</span><span class="w"> </span><span class="nb">first</span><span class="w"> </span><span class="p">(</span><span class="nf">a</span><span class="p">)</span>
<span class="w">  </span><span class="p">(</span><span class="nf">f</span><span class="w"> </span><span class="nv">a</span><span class="w"> </span><span class="mi">10</span><span class="p">))</span>
</pre></div>

<p>
Which when called&nbsp;gives:
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="nb">first</span><span class="w"> </span><span class="mi">26</span><span class="p">)</span>
</pre></div>

<pre class="example">
36
</pre>


<p>
If we want to override the default value (10) that&#8217;s passed&nbsp;to <code>f</code>
and instead use 25, we can define a new version that ignores the
second argument and uses our preferred default, and then
temporarily override the definition&nbsp;of <code>f</code> in the calling
environment. If we want to use the original in the overriding
definition we need to grab it first. This&nbsp;gives:
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">let</span><span class="w"> </span><span class="p">((</span><span class="nf">origf</span><span class="w"> </span><span class="p">(</span><span class="nf">symbol-function</span><span class="w"> </span><span class="ss">'f</span><span class="p">)))</span>
<span class="w">  </span><span class="p">(</span><span class="nf">cl-letf</span><span class="w"> </span><span class="p">(((</span><span class="nf">symbol-function</span><span class="w"> </span><span class="ss">'f</span><span class="p">)</span><span class="w"> </span><span class="p">(</span><span class="k">lambda</span><span class="w"> </span><span class="p">(</span><span class="nf">a</span><span class="w"> </span><span class="nv">b</span><span class="p">)</span>
<span class="w">				    </span><span class="p">(</span><span class="nf">funcall</span><span class="w"> </span><span class="nv">origf</span><span class="w"> </span><span class="nv">a</span><span class="w"> </span><span class="mi">25</span><span class="p">))))</span>
<span class="w">    </span><span class="p">(</span><span class="nb">first</span><span class="w"> </span><span class="mi">26</span><span class="p">)))</span>
</pre></div>

<pre class="example">
51
</pre>


<p>
What&#8217;s going on?&nbsp;The <code>cl-letf</code> macro is&nbsp;like <code>let</code> but works with
general places (as&nbsp;in <code>setf</code>). It sets the places in its argument
list for the duration of its body, and then restores them on exit,
regardless of whether that exit is normal or <i>via</i> a&nbsp;condition.
</p>

<p>
The <code>(symbol-function 'f)</code> form returns the place that stores the
function associated with&nbsp;symbol <code>f</code>. We use it twice: once to
capture this function so we can use it later, and once to identify
the place where we store our new variant function. This new binding
is then used for all calls made from the body of&nbsp;the <code>cl-letf</code>,
regardless of depth, so the call&nbsp;to <code>first</code> makes use of our variant
definition&nbsp;of <code>f</code> rather than the original – but with the original
then being used in the variant in our&nbsp;case!
</p>

<p>
If we&#8217;d&nbsp;used <code>let</code> or <code>cl-flet</code> instead&nbsp;of <code>cl-letf</code> we wouldn&#8217;t
have got the behaviour we&#8217;re looking&nbsp;for:
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">let</span><span class="w"> </span><span class="p">((</span><span class="nf">origf</span><span class="w"> </span><span class="p">(</span><span class="nf">symbol-function</span><span class="w"> </span><span class="ss">'f</span><span class="p">)))</span>
<span class="w">  </span><span class="p">(</span><span class="nf">cl-flet</span><span class="w"> </span><span class="p">((</span><span class="nf">f</span><span class="w"> </span><span class="p">(</span><span class="nf">a</span><span class="w"> </span><span class="nv">b</span><span class="p">)</span>
<span class="w">	      </span><span class="p">(</span><span class="nf">funcall</span><span class="w"> </span><span class="nv">origf</span><span class="w"> </span><span class="nv">a</span><span class="w"> </span><span class="mi">25</span><span class="p">))))</span>
<span class="w">    </span><span class="p">(</span><span class="nb">first</span><span class="w"> </span><span class="mi">26</span><span class="p">))</span>
</pre></div>

<pre class="example">
36
</pre>


<p>
Why?&nbsp;Because <code>let</code> and <code>cl-flet</code> work over the <i>scope</i> of the body,
so only calls&nbsp;to <code>f</code> directly from the body of the assignment are
affected – not calls from calls. This is a great illustration of
the difference between scope and extent,&nbsp;incidentally.
</p>

<p>
I did say it was horrible :-). It&#8217;s basically like adding&nbsp;temporary <code>:around</code> advice, and could probably benefit from a
macro to wrap it&nbsp;up.
</p>

<p>
Part of the horribleness comes from the fact that the redefinition
is made for the entire dynamic extent of the body forms, which
means <i>all</i> instances of the overridden function will use the
overridden value. There might be more than you think! But for
well-understood code it&#8217;s sometimes useful, avoiding duplicating
code to make tiny&nbsp;changes.
</p>
</div>
</div>
	    </div>
	</article>
</div>

	<!-- Social sharing section -->
  <div class="site-content">
    <div class="social">
      <ul>
<li><a onclick="MastodonShare(this);" data-src="Locally%20overriding%20a%20function%20throughout%20a%20dynamic%20extent%20%23emacs%20%23lisp&amp;url=https://simondobson.org/2024/01/22/locally-overriding-a-function-throughout-a-dynamic-extent/"><span title="Share on Mastodon"><i class="fab fa-mastodon"></i></span></a></li>
	<li><a href="https://twitter.com/share?text=Locally%20overriding%20a%20function%20throughout%20a%20dynamic%20extent%20%23emacs%20%23lisp&amp;url=https://simondobson.org/2024/01/22/locally-overriding-a-function-throughout-a-dynamic-extent/" target="_blak"><span title="Share on Twitter"><i class="fab
	fa-twitter"></i></span></a></li>
	<li><a href="https://www.reddit.com/submit?url=https://simondobson.org/2024/01/22/locally-overriding-a-function-throughout-a-dynamic-extent/&amp;title=Locally%20overriding%20a%20function%20throughout%20a%20dynamic%20extent%20%23emacs%20%23lisp" target="_blank"><span title="Share on Reddit"><i class="fab fa-reddit"></i></span></a></li>
	<li><a href="https://www.linkedin.com/shareArticle?url=https://simondobson.org/2024/01/22/locally-overriding-a-function-throughout-a-dynamic-extent/&amp;source=https://simondobson.org/" target="_blank"><span title="Share on LinkedIn"><i class="fab fa-linkedin"></i></span></a></li>
	<li><a href="mailto:?subject=Locally%20overriding%20a%20function%20throughout%20a%20dynamic%20extent&amp;body=https://simondobson.org/2024/01/22/locally-overriding-a-function-throughout-a-dynamic-extent/"><span title="Share by email"><i class="fa fa-envelope"></i></span></a></li>
      </ul>
</div>
  </div>

	<!-- Tag Section -->
    <div class="site-content navigation-post">
	<div class="tag-head">Tags</div>
	<div class="tag-list">
		<a href="../../../../categories/emacs/">emacs</a>
		    <span>  </span>
		<a href="../../../../categories/lisp/">lisp</a>
	</div>
    </div>

	<!-- Post Navigation links -->
<nav class="site-content navigation-post" role="navigation"><div class="previous">
	    <a href="../../../../goodreads/this-is-how-they-tell-me-the-world-ends-the-cyberweapons-arms-race/" rel="prev">
		<span class="meta-nav">Older Post</span>This Is How They Tell Me the World Ends: The Cyberweapons Arms Race
	    </a>
	</div>
</nav><!-- Page Footer --><section class="footer-sidebar clear" role="complementary"><div class="widget-block">
	    <aside class="widget"><h2 class="widget-title">Simon&nbsp;Dobson</h2>
		<div class="widget-text">Aut tace aut loquere meliora silentio</div>
	    </aside>
</div>
    </section><!-- Extra JavaScript --><script src="../../../../assets/js/mastodon-share.js"></script><!-- Site Attributions --><footer class="site-footer" role="contentinfo"><div class="site-info">
	    <p></p>
	    <p>
	      Built with free and open-source software.
	      Powered by <a href="https://getnikola.com/">Nikola</a> using a theme based on
	      <a href="https://themes.getnikola.com/v7/libretto/">Libretto</a>.
	    </p>
	    <p>
	      All content Copyright © 2010–2024 Simon Dobson and licensed under
	      <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/"><span class="caps">CC</span>-<span class="caps">BY</span>-<span class="caps">NC</span>-<span class="caps">SA</span>-4.0</a>
	      unless otherwise&nbsp;noted.
	    </p>
	</div>
	<div class="social">
	    <ul class="menu"></ul>
</div>
    </footer>
</body>
</html>